'''1. Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
'''


must_have = ['health', 'happy', 'money', '$', 1000000, True]
for i in must_have:
    print(type(i))




